KrzysztofPhotos/BeeNode-nRF52840-IoT/src/main.c
/**
 * ============================================================================
 * BeeNode - Beehive Monitoring System
 * ============================================================================
 * 
 * System monitorowania warunków w ulu pszczelim oparty na NRF52840 DK
 * 
 * Tryb pracy:
 * 1. Deep Sleep (System OFF) przez 10 minut
 * 2. Wybudzenie przez RTC
 * 3. Advertising przez 30 sekund (możliwość połączenia z RPi)
 * 4. Jeśli RPi się połączy - wysyłanie danych przez GATT
 * 5. Powrót do Deep Sleep
 * 
 * Architektura BLE:
 * - NRF52840 = Peripheral (slave)
 * - Raspberry Pi = Central (master)
 * - Dane w GATT Service (nie tylko w advertising)
 * - UUID do identyfikacji serwisu i charakterystyk
 */
#include <zephyr/drivers/sensor.h>
#include <zephyr/kernel.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/sys/printk.h>
#include <zephyr/random/random.h>
#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/hci.h>
#include <zephyr/bluetooth/conn.h>
#include <zephyr/bluetooth/uuid.h>
#include <zephyr/bluetooth/gatt.h>
#include <nrfx.h>
#include <string.h>
#include <zephyr/sys/poweroff.h> // dla uzywania sys_poweroff()
#include <hal/nrf_gpio.h>
#include <hal/nrf_radio.h>
#include <hal/nrf_power.h>
#include <zephyr/settings/settings.h>

/* ============================================================================
 * KONFIGURACJA CZASOWA
 * ============================================================================ */
#define ADVERTISING_DURATION_MS  30000   // 30 sekund advertising (30000)
#define DEEP_SLEEP_DURATION_S    600     // 10 minut deep sleep (600)
#define ADV_UPDATE_INTERVAL_MS   1000    // Aktualizacja danych co 1s podczas advertising


// Definicje pinow dla nRF52840-DK (DT=27, SCK=26)
#define HX711_DT_PIN  27
#define HX711_SCK_PIN 26

static const struct device *gpio0_dev = DEVICE_DT_GET(DT_NODELABEL(gpio0));

// Inicjalizacja pinów
static void hx711_init(void) {
    if (!device_is_ready(gpio0_dev)) {
        printk("BLAD: Port GPIO0 nie jest gotowy!\n");
        return;
    }
    // Zegar jako wyjscie (stan niski na start), Dane jako wejscie
    gpio_pin_configure(gpio0_dev, HX711_SCK_PIN, GPIO_OUTPUT_INACTIVE);
    gpio_pin_configure(gpio0_dev, HX711_DT_PIN, GPIO_INPUT);
    printk("HX711 zainicjalizowany recznie (pin 26 i 27)\n");
}

// Funkcja bit-banging czytajaca dane z HX711
static int32_t hx711_read(void) {
    int32_t count = 0;
    int timeout = 10000; 

    // Czekaj az uklad bedzie gotowy (linia DT zejdzie na LOW)
    while (gpio_pin_get(gpio0_dev, HX711_DT_PIN) == 1 && timeout > 0) {
        k_busy_wait(10);
        timeout--;
    }

    if (timeout == 0) {
        printk("BLAD: Timeout - HX711 nie odpowiada!\n");
        return 0;
    }

    // Odczyt 24 bitow danych
    for (int i = 0; i < 24; i++) {
        gpio_pin_set(gpio0_dev, HX711_SCK_PIN, 1);
        k_busy_wait(1); // 1 mikrosekunda w gore
        count = count << 1;
        gpio_pin_set(gpio0_dev, HX711_SCK_PIN, 0);
        k_busy_wait(1); // 1 mikrosekunda w dol
        
        if (gpio_pin_get(gpio0_dev, HX711_DT_PIN)) {
            count++;
        }
    }

    // 25 impuls to ustawienie wzmocnienia na 128 dla kolejnego pomiaru
    gpio_pin_set(gpio0_dev, HX711_SCK_PIN, 1);
    k_busy_wait(1);
    gpio_pin_set(gpio0_dev, HX711_SCK_PIN, 0);
    k_busy_wait(1);

    // Format U2 (wartosci ujemne)
    if (count & 0x800000) {
        count |= 0xFF000000;
    }

    return count;
}


/* ============================================================================
 * PARAMETRY KALIBRACJI I PAMIĘĆ NVS
 * ============================================================================ */
int32_t tare_offset = -600000;         // Domyslna tara
float calib_factor = 1000000.0;        // Domyslny wspolczynnik
float known_weight_kg = 0.1835;         // WAGA REDMI NOTE 12 4g
volatile bool start_calibration = false;

// Funkcja obsługująca zapis/odczyt z pamięci flash (NVS)
static int scale_settings_set(const char *name, size_t len, settings_read_cb read_cb, void *cb_arg) {
    const char *next;
    if (settings_name_steq(name, "tare", &next) && !next) {
        if (len != sizeof(tare_offset)) return -EINVAL;
        read_cb(cb_arg, &tare_offset, sizeof(tare_offset));
        return 0;
    }
    if (settings_name_steq(name, "factor", &next) && !next) {
        if (len != sizeof(calib_factor)) return -EINVAL;
        read_cb(cb_arg, &calib_factor, sizeof(calib_factor));
        return 0;
    }
    return -ENOENT;
}

struct settings_handler scale_conf = {
    .name = "scale",
    .h_set = scale_settings_set,
};

/* ============================================================================
 * PRZYCISK (SW1) - OBSŁUGA PRZERWAŃ
 * ============================================================================ */
static const struct gpio_dt_spec button = GPIO_DT_SPEC_GET_OR(DT_ALIAS(sw0), gpios, {0});
static struct gpio_callback button_cb;

static void button_pressed_isr(const struct device *dev, struct gpio_callback *cb, uint32_t pins) {
    start_calibration = true; // Flaga uruchamiajaca proces z opoznieniami
}

static int button_setup(void) {
    if (!device_is_ready(button.port)) {
        printk("WARN: Przycisk niedostępny\n");
        return -ENODEV;
    }
    gpio_pin_configure_dt(&button, GPIO_INPUT | GPIO_PULL_UP);
    gpio_pin_interrupt_configure_dt(&button, GPIO_INT_EDGE_TO_ACTIVE);
    gpio_init_callback(&button_cb, button_pressed_isr, BIT(button.pin));
    gpio_add_callback(button.port, &button_cb);
    printk("Przycisk SW1 gotowy do startu kalibracji!\n");
    return 0;
}

/* ============================================================================
 * POMOCNICZA: UŚREDNIANIE (jak w Arduino)
 * ============================================================================ */
static int32_t hx711_read_average(int times) {
    int64_t sum = 0;
    for (int i = 0; i < times; i++) {
        sum += hx711_read();
        k_sleep(K_MSEC(10)); // Krotka przerwa miedzy odczytami
    }
    return (int32_t)(sum / times);
}

/* ============================================================================
 * ODCZYT I KALIBRACJA WAGI
 * ============================================================================ */
static void test_read_weight(void) {
    // 1. PROCEDURA KALIBRACJI (Zainspirowana Arduino - z opoznieniami)
    if (start_calibration) {
        start_calibration = false;
        
