KrzysztofPhotos/BeeNode-nRF52840-IoT/src/main.c
        printk("\n========================================\n");
        printk("          START KALIBRACJI\n");
        printk("========================================\n");
        
        // Odpowiednik Arduino: Serial.println("Tare... remove any weights..."); delay(5000);
        printk("1. Zdejmij wszystko z wagi!\n");
        printk("   Masz 5 sekund...\n");
        k_sleep(K_SECONDS(5));
        
        // Odpowiednik Arduino: scale.tare();
        tare_offset = hx711_read_average(10); // Pobieramy srednia z 10 pomiarow
        settings_save_one("scale/tare", &tare_offset, sizeof(tare_offset));
        printk(">>> Tara zrobiona! (Wartosc: %d) <<<\n\n", tare_offset);
        
        // Odpowiednik Arduino: Serial.print("Place a known weight..."); delay(5000);
        printk("2. Poloz swoj telefon (%.3f kg) na wadze!\n", known_weight_kg);
        printk("   Masz 5 sekund...\n");
        k_sleep(K_SECONDS(5));
        
        // Odpowiednik Arduino: scale.get_units(10) i matematyka
        int32_t reading = hx711_read_average(10);
        calib_factor = (float)(tare_offset - reading) / known_weight_kg;
        settings_save_one("scale/factor", &calib_factor, sizeof(calib_factor));
        
        printk(">>> Wspolczynnik wyliczony! (Wartosc: %.1f) <<<\n", calib_factor);
        printk("========================================\n");
        printk("        KALIBRACJA ZAKONCZONA!\n");
        printk("========================================\n\n");
        return; 
    }

    // 2. NORMALNY ODCZYT (odpala sie caly czas, gdy nie kalibrujemy)
    int32_t raw_val = hx711_read();
    int32_t weight_no_tare = tare_offset - raw_val;
    
    // Delikatne zerowanie szumow w okolicach zera (do 5 gramow)
    if (weight_no_tare < 0 && weight_no_tare > -5000) {
        weight_no_tare = 0; 
    }
    
    double weight_kg = (double)weight_no_tare / calib_factor;
    printk(">>> SUROWY: %d | WAGA: %.3f kg <<<\n", raw_val, weight_kg);
}




/* ============================================================================
 * STRUKTURA DANYCH SENSORYCZNYCH
 * ============================================================================ */

/**
 * Ramka zawierająca wszystkie dane z czujników
 * Pakowana bez paddingu dla optymalnej transmisji BLE
 */
struct __packed sensor_frame_t {
    uint8_t  dev_id_3[3];    // 24-bitowy ID urządzenia (z FICR)
    uint32_t date_hour;      // Timestamp (na razie nieużywany)
    int16_t  temp_x10;       // Temperatura * 10 (np. 235 = 23.5°C)
    int16_t  hum_x10;        // Wilgotność * 10 (np. 650 = 65.0%)
    uint16_t lux;            // Natężenie światła [lux]
    uint32_t weight;         // Waga ula [gramy]
    uint16_t in_bees;        // Liczba pszczół wlatujących
    uint16_t out_bees;       // Liczba pszczół wylatujących
    uint8_t  stat;           // Status (0/1)
    char     pp[2];          // Marker "PP"
};

// Globalna instancja ramki danych
static struct sensor_frame_t frame;

/* ============================================================================
 * BLUETOOTH LOW ENERGY - ADVERTISING
 * ============================================================================ */

// Manufacturer Data: Company ID (0x0059) + sensor_frame
static uint8_t mfg_data[2 + sizeof(frame)] = {0x59, 0x00};

// Advertising Data - zawiera flagi i manufacturer data
static const struct bt_data ad[] = {
    BT_DATA_BYTES(BT_DATA_FLAGS, BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR),
    BT_DATA(BT_DATA_MANUFACTURER_DATA, mfg_data, sizeof(mfg_data)),
};

// Scan Response Data - nazwa urządzenia
static const struct bt_data sd[] = {
    BT_DATA(BT_DATA_NAME_COMPLETE, "BeeNode", 7),
};

/* ============================================================================
 * BLUETOOTH LOW ENERGY - GATT SERVICE
 * ============================================================================ */

/**
 * UUID dla BeeNode Service: 12345678-1234-5678-1234-56789abcdef0
 * UUID dla Sensor Data Characteristic: 12345678-1234-5678-1234-56789abcdef1
 * 
 * RPi będzie szukać tego UUID i odczytywać dane
 */

#define BT_UUID_BEENODE_SERVICE_VAL \
    BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef0)

#define BT_UUID_BEENODE_SENSOR_DATA_VAL \
    BT_UUID_128_ENCODE(0x12345678, 0x1234, 0x5678, 0x1234, 0x56789abcdef1)

static struct bt_uuid_128 beenode_service_uuid = BT_UUID_INIT_128(
    BT_UUID_BEENODE_SERVICE_VAL
);

static struct bt_uuid_128 sensor_data_uuid = BT_UUID_INIT_128(
    BT_UUID_BEENODE_SENSOR_DATA_VAL
);

/**
 * Callback do odczytu danych z charakterystyki
 * RPi wywoła to podczas bt_gatt_read()
 */
static ssize_t read_sensor_data(struct bt_conn *conn,
                                const struct bt_gatt_attr *attr,
                                void *buf, uint16_t len, uint16_t offset)
{
    printk("GATT: Central czyta dane sensoryczne\n");
    
    // Zwróć całą strukturę sensor_frame
    return bt_gatt_attr_read(conn, attr, buf, len, offset,
                            &frame, sizeof(frame));
}

// Definicja GATT Service
BT_GATT_SERVICE_DEFINE(beenode_svc,
    BT_GATT_PRIMARY_SERVICE(&beenode_service_uuid),
    BT_GATT_CHARACTERISTIC(&sensor_data_uuid.uuid,
                          BT_GATT_CHRC_READ,
                          BT_GATT_PERM_READ,
                          read_sensor_data, NULL, NULL),
);

/* ============================================================================
 * PRZYCISK (opcjonalny - do testowania)
 * ============================================================================ */

//static const struct gpio_dt_spec button = GPIO_DT_SPEC_GET_OR(DT_ALIAS(sw0), gpios, {0});
// static struct gpio_callback button_cb;
// static volatile bool button_pressed = false;

// static void button_pressed_isr(const struct device *dev, 
//                                struct gpio_callback *cb, 
//                                uint32_t pins)
// {
//     button_pressed = true;
//     printk("Przycisk wciśnięty!\n");
// }

// static int button_setup(void)
// {
//     if (!device_is_ready(button.port)) {
//         printk("WARN: Przycisk niedostępny\n");
//         return -ENODEV;
//     }

