KrzysztofPhotos/BeeNode-nRF52840-IoT/src/main.c
//     gpio_pin_configure_dt(&button, GPIO_INPUT | GPIO_PULL_UP);
//     // gpio_pin_interrupt_configure_dt(&button, GPIO_INT_EDGE_TO_ACTIVE);
//     // gpio_init_callback(&button_cb, button_pressed_isr, BIT(button.pin));
//     // gpio_add_callback(button.port, &button_cb);
    
//     printk("Przycisk skonfigurowany (pin %d)\n", button.pin);
//     return 0;
// }

/* ============================================================================
 * GENERATORY FAKE DANYCH (do testów bez czujników)
 * ============================================================================ */

static double fake_temp(void)   { 
    return 20.0 + (sys_rand32_get() % 1000) / 100.0;  // 20.0 - 30.0°C
}

static double fake_hum(void)    { 
    return 50.0 + (sys_rand32_get() % 500) / 10.0;    // 50.0 - 100.0%
}

static uint16_t fake_lux(void)  { 
    return 100 + (sys_rand32_get() % 1000);           // 100 - 1100 lux
}

static uint32_t fake_weight(void) { 
    return 100000 + (sys_rand32_get() % 50000);       // 100-150 kg
}

static uint16_t fake_in(void)   { 
    return sys_rand32_get() % 300;                    // 0 - 300 pszczół
}

static uint16_t fake_out(void)  { 
    return sys_rand32_get() % 300;                    // 0 - 300 pszczół
}

static uint8_t fake_stat(void) { 
    return sys_rand32_get() % 2;                      // 0 lub 1
}

/* ============================================================================
 * ODCZYT DEVICE ID Z NRF FICR
 * ============================================================================ */

/**
 * Odczytuje 24-bitowy Device ID z Factory Information Configuration Registers
 * Każdy chip NRF ma unikalny 64-bitowy ID, my używamy dolnych 24 bitów
 */
static void read_dev_id_24(uint8_t out[3])
{
    uint32_t d0 = NRF_FICR->DEVICEID[0];
    uint32_t d1 = NRF_FICR->DEVICEID[1];

    // Kombinujemy dolne 16 bitów z d0 i dolne 8 bitów z d1
    uint32_t dev24 = ((d1 & 0xFF) << 16) | (d0 & 0xFFFF);
    
    out[0] = (dev24 >> 16) & 0xFF;
    out[1] = (dev24 >> 8) & 0xFF;
    out[2] = dev24 & 0xFF;
    
    printk("Device ID: 0x%02X%02X%02X\n", out[0], out[1], out[2]);
}

/* ============================================================================
 * AKTUALIZACJA RAMKI DANYCH
 * ============================================================================ */

/**
 * Odświeża wszystkie dane w strukturze sensor_frame
 * Kopiuje dane do manufacturer data dla advertising
 */
static void update_sensor_frame(void)
{
    // Odczytaj Device ID (tylko raz na początku, ale dla pewności każdorazowo)
    read_dev_id_24(frame.dev_id_3);
    
    // Timestamp (TODO: dodać real-time clock)
    frame.date_hour = k_uptime_get_32() / 1000; // uptime w sekundach
    
    // Odczyt czujników (na razie fake data)
    frame.temp_x10 = (int16_t)(fake_temp() * 10);
    frame.hum_x10  = (int16_t)(fake_hum() * 10);
    frame.lux      = fake_lux();
    frame.weight   = fake_weight();
    frame.in_bees  = fake_in();
    frame.out_bees = fake_out();
    frame.stat     = fake_stat();
    
    // Marker
    frame.pp[0] = 'P';
    frame.pp[1] = 'P';

    // Skopiuj strukturę do manufacturer data (dla advertising)
    memcpy(&mfg_data[2], &frame, sizeof(frame));

    printk("Dane zaktualizowane: T=%.1f°C, H=%.1f%%, Lux=%u, Waga=%ug, In=%u, Out=%u, Stat=%u\n",
           frame.temp_x10 / 10.0, frame.hum_x10 / 10.0, 
           frame.lux, frame.weight, frame.in_bees, frame.out_bees, frame.stat);
}

/* ============================================================================
 * BLUETOOTH - CONNECTION CALLBACKS
 * ============================================================================ */

static struct bt_conn *current_conn = NULL;

static void connected(struct bt_conn *conn, uint8_t err)
{
    if (err) {
        printk("BLE: Błąd połączenia: %u\n", err);
        return;
    }

    char addr[BT_ADDR_LE_STR_LEN];
    bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));
    printk("BLE: Połączono z %s\n", addr);
    
    current_conn = bt_conn_ref(conn);
}

static void disconnected(struct bt_conn *conn, uint8_t reason)
{
    char addr[BT_ADDR_LE_STR_LEN];
    bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));
    printk("BLE: Rozłączono z %s (powód: %u)\n", addr, reason);
    
    if (current_conn) {
        bt_conn_unref(current_conn);
        current_conn = NULL;
    }
}

BT_CONN_CB_DEFINE(conn_callbacks) = {
    .connected = connected,
    .disconnected = disconnected,
};

/* ============================================================================
 * BLUETOOTH - INICJALIZACJA
 * ============================================================================ */

static void bt_ready(int err)
{
    if (err) {
        printk("BLE: Błąd inicjalizacji: %d\n", err);
        return;
    }
    printk("BLE: Stack gotowy\n");
}

/* ============================================================================
 * ADVERTISING - ZARZĄDZANIE
 * ============================================================================ */

/**
 * Rozpoczyna advertising z szybkim interwałem
 * Umożliwia szybkie wykrycie przez RPi
 */
static int start_advertising(void)
{
    // DEBUGOWANIE: Sprawdź rozmiary
    printk("DEBUG: sizeof(sensor_frame_t) = %u\n", sizeof(struct sensor_frame_t));
    printk("DEBUG: sizeof(mfg_data) = %u\n", sizeof(mfg_data));
    printk("DEBUG: Total AD payload = %u bytes\n", 
           3 + sizeof(mfg_data) + 2);  // FLAGS + MFG_DATA + overhead
    
    // Sprawdź czy BT jest gotowy
    if (!bt_is_ready()) {
        printk("ERROR: Bluetooth nie jest gotowy!\n");
        return -EAGAIN;
    }

    struct bt_le_adv_param adv_param = {
        .id = BT_ID_DEFAULT,
        .options = BT_LE_ADV_OPT_CONNECTABLE |
                   BT_LE_ADV_OPT_USE_TX_POWER,  // Usunięto USE_NAME
        .interval_min = BT_GAP_ADV_FAST_INT_MIN_2,  // 100 ms
        .interval_max = BT_GAP_ADV_FAST_INT_MAX_2,  // 150 ms
    };

    int err = bt_le_adv_start(&adv_param, ad, ARRAY_SIZE(ad), sd, ARRAY_SIZE(sd));
    if (err) {
        printk("ERROR: Błąd startu advertising: %d (", err);
        switch(err) {
            case -EINVAL: printk("EINVAL - nieprawidłowe parametry)\n"); break;
            case -EALREADY: printk("EALREADY - advertising już aktywny)\n"); break;
            case -ENOTSUP: printk("ENOTSUP - niewspierana operacja)\n"); break;
            case -ENOMEM: printk("ENOMEM - brak pamięci)\n"); break;
            case -EAGAIN: printk("EAGAIN - spróbuj ponownie)\n"); break;
            default: printk("Nieznany błąd)\n");
        }
        return err;
    }

    printk("BLE: Advertising rozpoczęty ✓\n");
    return 0;
}

/**
 * Zatrzymuje advertising
 */
static void stop_advertising(void)
{
    int err = bt_le_adv_stop();
    if (err) {
        printk("BLE: Błąd zatrzymania advertising: %d\n", err);
    } else {
        printk("BLE: Advertising zatrzymany\n");
    }
}

/* ============================================================================
 * DEEP SLEEP (SYSTEM OFF)
 * ============================================================================ */

/**
 * Przechodzi w tryb System OFF z wybudzeniem przez RTC
 * 
 * UWAGA: W trybie System OFF:
 * - Zatrzymane są wszystkie peryferia (BLE, UART, itp.)
 * - Pobór prądu ~0.4 µA
 * - Wybudzenie = reset systemu (program startuje od początku)
 * - Zachowana jest tylko pamięć RAM (jeśli skonfigurowana)
 * 
 * @param seconds Czas snu w sekundach
 */
static void enter_deep_sleep(uint32_t seconds)
{
    printk("System OFF na %u sekund\n", seconds);

    /* 1. Start LFCLK (RTC tego wymaga) */
    NRF_CLOCK->TASKS_LFCLKSTART = 1;
    while (!NRF_CLOCK->EVENTS_LFCLKSTARTED);
    NRF_CLOCK->EVENTS_LFCLKSTARTED = 0;

    /* 2. Konfiguracja RTC1 */
    NRF_RTC1->TASKS_STOP = 1;
    NRF_RTC1->TASKS_CLEAR = 1;
    NRF_RTC1->PRESCALER = 0; // 32768 Hz

    uint32_t ticks = seconds * 32768;
    if (ticks > 0x00FFFFFF) {
        ticks = 0x00FFFFFF;
    }

    NRF_RTC1->CC[0] = ticks;
    NRF_RTC1->EVENTS_COMPARE[0] = 0;
    NRF_RTC1->EVTENSET = RTC_EVTENSET_COMPARE0_Msk;
    NRF_RTC1->TASKS_START = 1;

    /* 3. Wake-up z przycisku (P0.11 – BUTTON1) */
    NRF_GPIO->PIN_CNF[NRF_GPIO_PIN_MAP(0,11)] =
        (GPIO_PIN_CNF_SENSE_Low << GPIO_PIN_CNF_SENSE_Pos) |
        (GPIO_PIN_CNF_PULL_Pullup << GPIO_PIN_CNF_PULL_Pos) |
        (GPIO_PIN_CNF_INPUT_Connect << GPIO_PIN_CNF_INPUT_Pos) |
        (GPIO_PIN_CNF_DIR_Input << GPIO_PIN_CNF_DIR_Pos);

    printk("SYSTEM OFF\n");

