KrzysztofPhotos/BeeNode-nRF52840-IoT/src/main.c
    /* 4. System OFF */
    NRF_POWER->SYSTEMOFF = 1;

    while (1) {
        __WFE();
    }
}


/* ============================================================================
 * MAIN LOOP
 * ============================================================================ */

int main(void)
{
    printk("\n");
    printk("========================================\n");
    printk("  BeeNode - Beehive Monitor v1.0\n");
    printk("========================================\n");
    printk("Board: NRF52840 DK\n");
    printk("Build: %s %s\n", __DATE__, __TIME__);
    printk("========================================\n\n");

    // Inicjalizacja naszej wagi
    hx711_init();

    // Inicjalizacja przycisku
    button_setup();

    // --- Inicjalizacja i wczytanie pamieci ---
    settings_subsys_init();
    settings_register(&scale_conf);
    settings_load();
    printk("Zaladowano z pamieci NVS -> Tara: %d, Wspolczynnik: %.1f\n", tare_offset, calib_factor);
    // -----------------------------------------

    // Inicjalizacja Bluetooth
    int err = bt_enable(bt_ready);
    if (err) {
        printk("FATAL: Bluetooth enable failed: %d\n", err);
        return err;
    }
    k_sleep(K_MSEC(500));  // Daj czas na inicjalizację

    // --- TX POWER +4 dBm ---
    // Ustaw TX power radia na +4 dBm (nRF52840)
    NRF_RADIO->TXPOWER = RADIO_TXPOWER_TXPOWER_Pos4dBm;
    printk("TX power ustawiony na +4 dBm (RADIO)\n");

    printk("\n=== GŁÓWNA PĘTLA PROGRAMU ===\n\n");

    while (1) {
        // ---------------------------------------------------------------
        // FAZA 1: ADVERTISING (30 sekund)
        // ---------------------------------------------------------------
        printk(">>> FAZA 1: Advertising przez %d sekund\n", 
               ADVERTISING_DURATION_MS / 1000);
        
        // Zaktualizuj dane przed rozpoczęciem advertising
        update_sensor_frame();
        
        // Rozpocznij advertising
        err = start_advertising();
        if (err) {
            printk("ERROR: Nie można rozpocząć advertising, restart...\n");
            k_sleep(K_SECONDS(5));
            continue;
        }

        // Główna pętla advertising
        uint64_t adv_start_time = k_uptime_get();
        bool connection_handled = false;
        
        while (k_uptime_get() - adv_start_time < ADVERTISING_DURATION_MS) {
            
            // Sprawdź czy RPi się połączył
            if (current_conn) {
                printk("\n!!! RPi połączony - czekam na odczyt GATT !!!\n");
                
                // Daj czas RPi na odczyt danych przez GATT
                // W prawdziwej aplikacji możesz dodać notification callback
                k_sleep(K_SECONDS(5));
                
                // Rozłącz się
                printk("Rozłączam połączenie...\n");
                bt_conn_disconnect(current_conn, 
                                  BT_HCI_ERR_REMOTE_USER_TERM_CONN);
                k_sleep(K_MSEC(500));
                
                connection_handled = true;
                break;  // Wyjdź z pętli advertising
            }
            
            // Aktualizuj dane w advertising co jakiś czas
            if ((k_uptime_get() - adv_start_time) % ADV_UPDATE_INTERVAL_MS == 0) {
                update_sensor_frame();
                bt_le_adv_update_data(ad, ARRAY_SIZE(ad), sd, ARRAY_SIZE(sd));
            }
            
            k_sleep(K_MSEC(100));
            
            test_read_weight(); // <--- NASZA WAGA JEST TUTAJ
        }

        // Zatrzymaj advertising po upływie czasu
        stop_advertising();

        if (connection_handled) {
            printk(">>> Połączenie obsłużone, przechodzę do deep sleep\n");
        } else {
            printk(">>> Brak połączenia, przechodzę do deep sleep\n");
        }

        // ---------------------------------------------------------------
        // FAZA 2: DEEP SLEEP (10 minut)
        // ---------------------------------------------------------------
        // UWAGA: Po wybudzeniu z System OFF program restartuje od main()
        
        enter_deep_sleep(DEEP_SLEEP_DURATION_S);
        
        // Ten kod nigdy się nie wykona w prawdziwym System OFF
        // (system się zrestartuje)
        printk(">>> Wybudzenie z deep sleep (symulacja)\n");
        k_sleep(K_SECONDS(2));
    }

    return 0;
}

/**
 * ============================================================================
 * NOTATKI IMPLEMENTACYJNE
 * ============================================================================
 * 
 * TODO dla pełnej funkcjonalności:
 * 
 * 1. DEEP SLEEP:
 *    - Zamień __WFE() loop na sys_poweroff() gdy SDK to wspiera
 *    - Skonfiguruj retention RAM jeśli potrzebne
 *    - Dodaj GPIO wake-up jako backup (np. przycisk)
 * 
 * 2. POWER MANAGEMENT:
 *    - Włącz CONFIG_PM=y w prj.conf
 *    - Optymalizuj power consumption w stanie advertising
 *    - Zmierz rzeczywisty pobór prądu
 * 
 * 3. REAL-TIME CLOCK:
 *    - Dodaj obsługę RTC dla timestamp w date_hour
 *    - Synchronizacja czasu z RPi przy pierwszym połączeniu
 * 
 * 4. CZUJNIKI:
 *    - Zamień fake_*() na prawdziwe odczyty I2C/SPI
 *    - Dodaj error handling dla czujników
 *    - Kalibracja czujników
 * 
 * 5. GATT:
 *    - Dodaj więcej charakterystyk (konfiguracja, status, itp.)
 *    - Notifications dla real-time data streaming
 *    - Write characteristic dla konfiguracji zdalnej
 * 
 * 6. TESTOWANIE:
 *    - Test z nRF Connect (advertising + GATT)
 *    - Test z RPi Central (automatyczne połączenie)
 *    - Test power consumption
 *    - Test długoterminowy (stabilność)
 * 
 * ============================================================================
 */

 
